Revit 2027 API
IndexStreamPoint.AddPoints Method
 Inserts multiple IndexPoint instances into the stream and associated buffer.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddPoints(
	IList<IndexPoint> points
)
Public Sub AddPoints (
	points As IList(Of IndexPoint)
)
public:
void AddPoints(
	IList<IndexPoint^>^ points
)
member AddPoints :
        points : IList<IndexPoint> -> unit
Parameters
points IList<IndexPoint>
 The points to be inserted.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space.
See Also
Reference
IndexStreamPoint Class
Autodesk.Revit.DB.DirectContext3D Namespace